Revit 2026 API

# ElectricalSystemCircuitNumber Property

---

The CircuitNumber of the Electrical System.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string CircuitNumber { get; }
```
```vb
Public ReadOnly Property CircuitNumber As String
	Get
```
```cpp
public:
property String^ CircuitNumber {
	String^ get ();
}
```
```fsharp
member CircuitNumber : string with get
```

#### Property Value

String

This property is used to retrieve the CircuitNumber of the Electrical System.

#### Reference

ElectricalSystem Class

Autodesk.Revit.DB.Electrical Namespace